Repository: GrPnd/company-management-system
Catalog: CollabCore/App.Resources/Domain/FrontEnd.*.resx
Languages: et

source: Dashboard
et: Töölaud

source: You are not in any teams!
et: Sa pole üheskis tiimis!

source: My Absences
et: Minu puudumised

source: Tasks
et: Ülesanded

source: Tickets
et: Kaebused

source: Absences
et: Puudumised

source: Messages
et: Sõnumid

source: Login
et: Logi sisse

source: Register
et: Registreeri

source: Logout
et: Logi välja

source: No tasks remaining!
et: Kõik ülesanded on tehtud!

source: My Tasks
et: Minu ülesaned

source: My Tickets
et: Minu kaebused

source: My Messages
et: Minu sõnumid

source: Send a new message
et: Saada uus sõnum

source: Write a Ticket
et: Koosta kaebus

source: Request a Absence
et: Taotle eemalviibimine

source: You don't have/haven't sent any messages!
et: Sul pole või pole saatnud ühtegi sõnumit!

source: Team
et: Tiim

source: Details
et: Detailid

source: My Account
et: Minu konto

source: My Career
et: Minu karjäär

source: User Management
et: Kasutajate haldus

source: Users
et: Kasutajad

source: Persons
et: Isikud

source: Teams
et: Tiimid

source: Team Management
et: Tiimide haldus

source: Departments
et: Osakonnad

source: Persons In Teams
et: Isikud tiimides

source: Create new Person
et: Loo uus isik

source: Create new Team
et: Loo uus tiim

source: Currently there are no teams!
et: Hetkel pole olemas ühtegi tiimi!

source: Create Person in Team
et: Loo uus isik tiimi

source: Currently there are no users in teams!
et: Hetkel pole ühtegi isikut tiimis!

source: Team Role
et: Roll tiimis

source: Manage Absences/Tickets
et: Halda eemalviibimisi/kaebusid

source: No absences have been requested!
et: Ühtegi eemalviibimist pole esitatud!

source: Absence Requests
et: Eemalviibimise taotlused

source: My Teams
et: Minu tiimid

source: Upcoming Meetings
et: Tulevased kohtumised

source: No meetings are upcoming!
et: Ühtegi kohtumist pole tulekul!

source: You are the only member!
et: Sa oled ainuke tiimi liige!

source: Team Members
et: Tiimi liikmed

source: Edit
et: Muuda

source: Save
et: Salvesta

source: Delete
et: Kustuta

source: Cancel
et: Tühista

source: Create a new Meeting
et: Loo uus koosolek

source: Starts
et: Algab

source: Mandatory
et: Kohustuslik

source: Actions
et: Tegevused

source: Manage Tasks
et: Halda ülesaneid

source: Manage Meetings
et: Halda koosolekuid

source: Tickets/Absences
et: Kaebused/Eemalviibimised

source: Is Mandatory
et: On kohustuslik

source: Start Date
et: Alguskuupäev

source: Name
et: Nimi

source: Are you sure you want to delete this meeting?
et: Oled sa kindel, et soovid kustutada selle koosoleku?

source: No teams
et: Pole ühtegi tiimi

source: No tickets have been sent to you!
et: Sulle pole saadetud ühtegi kaebust!

source: By
et: Poolt

source: Manage Absence Request
et: Halda eemalviibiste taotlusi

source: Approved
et: Kinnitatud

source: You haven't written any tickets!
et: Sa pole saatnud ühtegi kaebust!

source: To
et: Kellele

source: Title
et: Pealkiri

source: Description
et: Kirjeldus

source: This field is required!
et: See väli on kohustuslik!

source: Send to
et: Saada

source: Status
et: Staatus

source: Update Status
et: Uuenda staatust

source: Update Status for
et: Uuenda staatust

source: Create a new Task
et: Loo uus ülesanne

source: Manage Task
et: Halda ülesannet

source: Deadline
et: Tähtaeg

source: Manage Users
et: Halda kasutajaid

source: Add users to ask
et: Lisa kasutajaid ülesandele

source: Select a member
et: Vali tiimi liige

source: Assign to
et: Määra

source: Create a Ticket
et: Loo kaebus

source: First Name
et: Eesnimi

source: Required!
et: Kohustuslik

source: Create Account
et: Loo kasutaja

source: Password
et: Salasõna

source: Last Name
et: Perekonnanimi

# Registred successfully
source: Registred successfully. Please wait for the admin to verify your account! :)
et: Registreeritud edukalt. Palun oota, et administraator valideerikus sinu kasutaja! :)

source: From
et: Kellelt

source: Delete Message
et: Kustuta sõnum

source: Are you sure you want to delete this message?
et: Oled sa kindel, et soovid kustutada selle sõnumi?

source: Text message
et: Sõnum

source: Team Name
et: Tiimi nimi

source: Team Role Name
et: Roll tiimis

source: In the team since
et: Tiimis alates

source: In the team until
et: Tiimis kuni

source: Edit Person in Team
et: Halda isikut tiimis

source: User
et: Kasutaja

source: Since
et: Alates

source: Until
et: Kuni

source: Optional
et: Valikuline

source: Person
et: Isik

source: Are you sure you want to delete this user in team?
et: Oled sa kindel, et soovid kustutada selle kasutaja tiimis?

source: Delete User in Team
et: Kustuta isik tiimis

source: Edit Team
et: Halda tiimi

source: Department
et: Osakond

source: Are you sure you want to delete team?
et: Oled sa kindel, et soovid kustutada selle tiimi?

source: Delete Team
et: Kustuta tiim

source: Edit Person
et: Halda isikut

source: Delete Person
et: Kustuta isik

source: Are you sure you want to delete this person?
et: Oled sa kindel, et soovid kustutada selle isiku?

source: Create a new Department
et: Loo uus osakond

source: Currently there are no departments!
et: Hetkel pole ühtegi osakonda!

source: Edit Department
et: Halda osakonda

source: Delete Department
et: Kustuta osakond

source: Are you sure you want to delete this department?
et: Oled sa kindel, et soovid kustutada selle osakonna?

source: App Users
et: Äpi kasutajad

source: Phone
et: Telefon

source: Address
et: Aadress

source: Additional info
et: Lisainfo

source: Date
et: Kuupäev

source: Reasoning
et: Põhjus

source: Reason
et: Põhjus

source: End Date
et: Lõppkuupäev

source: Department Name
et: Osakonna nimi

source: Select a Department
et: Vali osakond

source: Update
et: Uuenda

source: Create
et: Loo

source: Send
et: Saada

source: Message content
et: Sõnumi sisu

# Select User
source: Select a User
et: Vali kasutaja

# Select Team
source: Select a Team
et: Vali tiim

# Select Team Role
source: Select a Team Role
et: Vali tiimi roll

source: Edit Meeting
et: Halda koosolekut

source: Delete Meeting
et: Kustuta koosolek

source: No
et: Ei

source: You haven't requested any absences!
et: Sa pole taotlenud ühtegi eemalviibimist!

source: Yes
et: Jah
